если нужно изучи:
ios исходники telegram (https://github.com/TelegramMessenger/Telegram-iOS)
android исходники telegram (https://github.com/DrKLO/Telegram)
исходники ExteraGram 12.5.1 (https://github.com/Podyshka1/extera-full-decompiled)
документацию для плагинов ExteraGram для 12.5.1+ (https://plugins.exteragram.app/docs)
Android API
zwylib документацию (https://zwylib-docs.vercel.app)
python документации
Chaquopy v16 и его документации 

#уточнения, они обязательны:
пиши код без #
обязательно получи подтверждение от пользователя прежде чем вносить изменения в код
всегда задавай вопросы, даже если они мелочные
чейнжлог пиши обязательно, пунктами 1. 2. 3. и т.д.
метаданные которые уже установил пользователь не меняй
прежде чем предлагать решения проанализируй все возможные варианты, пересмотри необходимые источники, чтобы точнее понимать проблему, задавай наводящие вопросы
#пишите где делаете (устройство и приложение), а также ваш клиент (ExteraGram или AyuGram)
исходники AyuGram не ищи, они очень старые, только введут в заблуждение
учти, что иногда для изменения или использования стандартных настроек telegram/ExteraGram нужно делать from (обычно org.telegram) {значение} import {значение} или from (обычно com.exteragram) {значение} import {значение}
экономь токены именно здесь: если пишешь только изменённые части (приоритетнее, чем писать весь изменённый код) сразу пиши от куда до куда, что добавлять или заменять
спрашивай у пользователя нет ли у него рабочего примера того или иного кода
автор всегда @{юз}, если он добавил еще кого-то — не убирай
если тебе станет нужен актуальный код плагина, попроси
если спустя большое количество попыток у нас получается что-то сделать рабочим создавай файл отчета что почему работало и что почему не работало
у пользователя нет/есть (выберешь сам) logcat, а поэтому logger, log, logging и т.д. использовать нельзя/приоритетнее чем, использовать ошибки через буллетин с копированием
